<template>
  <ToolLayout>
    <section class="section">
      <el-descriptions
        v-for="item in list"
        :key="item.cate"
        :column="isMobile ? 1 : 2"
        size="large"
        border
        style="margin-bottom: 32px"
      >
        <template #title>
          <h2 class="section__title">
            {{ item.cate }}
          </h2>
        </template>
        <el-descriptions-item v-for="child in item.children" :key="child.name" :label="child.name" :width="140">
          {{ child.tel }}
        </el-descriptions-item>
      </el-descriptions>
    </section>
  </ToolLayout>
</template>

<script setup lang="ts">
definePageMeta({
  title: '常用电话号码',
  description: '公共服务或者常用电话号码大全。'
})

const isMobile = useState('isMobile', () => false)

const list = reactive([
  {
    cate: '公共服务',
    children: [
      {
        name: '民警、匪警、报警服务台',
        tel: '110'
      },
      {
        name: '火灾、火警',
        tel: '119'
      },
      {
        name: '急救中心',
        tel: '120'
      },
      {
        name: '交通事故、交警',
        tel: '122'
      },
      {
        name: '水上求救专用电话',
        tel: '12395'
      },
      {
        name: '天气预报',
        tel: '12121'
      },
      {
        name: '报时服务',
        tel: '12117'
      },
      {
        name: '森林火警',
        tel: '12119'
      },
      {
        name: '电力服务',
        tel: '95598'
      },
      {
        name: '红十字会急救台',
        tel: '999'
      },
      {
        name: '公安短信报警',
        tel: '12110'
      },
      {
        name: '通用紧急求救',
        tel: '112'
      }
    ]
  },
  {
    cate: '中央党政部门、公益团体',
    children: [
      {
        name: '信产部IP/网站备案',
        tel: '010-66411166'
      },
      {
        name: '文化部',
        tel: '010-65551114'
      },
      {
        name: '教育部',
        tel: '010-66096114'
      },
      {
        name: '农业部',
        tel: '010-64193366'
      },
      {
        name: '建设部',
        tel: '010-58934114'
      },
      {
        name: '劳动部',
        tel: '010-84201114'
      },
      {
        name: '交通部',
        tel: '010-65292114'
      },
      {
        name: '民政部',
        tel: '010-58160600'
      },
      {
        name: '水利部',
        tel: '010-63202114'
      },
      {
        name: '海关总署',
        tel: '010-65194114'
      },
      {
        name: '外交部',
        tel: '010-65961114'
      },
      {
        name: '财政部',
        tel: '010-68551114'
      },
      {
        name: '壹基金',
        tel: '021-52504617'
      },
      {
        name: '红十字会',
        tel: '010-84025890'
      },
      {
        name: '中华慈善总会',
        tel: '010-66083260'
      },
      {
        name: '中国扶贫基金会',
        tel: '010-82872688'
      },
      {
        name: '中国青少年发展基金会',
        tel: '010-64035547'
      }
    ]
  },
  {
    cate: '保险公司',
    children: [
      {
        name: '中国人寿保险',
        tel: '95519'
      },
      {
        name: '中国人保保险',
        tel: '95518'
      },
      {
        name: '中华联合保险',
        tel: '95585'
      },
      {
        name: '泰康人寿保险',
        tel: '95522'
      },
      {
        name: '太平洋保险',
        tel: '95500'
      },
      {
        name: '天安保险',
        tel: '95505'
      },
      {
        name: '华安财险',
        tel: '95556'
      },
      {
        name: '新华人寿保险',
        tel: '95567'
      },
      {
        name: '平安保险',
        tel: '95511'
      },
      {
        name: '大众保险',
        tel: '95507'
      },
      {
        name: '中国大地保险',
        tel: '95590'
      },
      {
        name: '太平人寿保险',
        tel: '95589'
      },
      {
        name: '华泰财险',
        tel: '95509'
      },
      {
        name: '安邦财险',
        tel: '95569'
      }
    ]
  },
  {
    cate: '汽车公司',
    children: [
      {
        name: '吉利汽车',
        tel: '4008869888'
      },
      {
        name: '长春一汽',
        tel: '8008468680'
      },
      {
        name: '一汽马自达',
        tel: '8008468680'
      },
      {
        name: '宝马汽车',
        tel: '4008006666'
      },
      {
        name: '广汽丰田',
        tel: '8008308888'
      },
      {
        name: 'BUICK别克',
        tel: '8008202020'
      },
      {
        name: '东南汽车',
        tel: '8008581666'
      },
      {
        name: '奇瑞汽车',
        tel: '4008838888'
      },
      {
        name: '一汽大众',
        tel: '4008171888'
      },
      {
        name: '东风日产',
        tel: '8008308899'
      },
      {
        name: '奔驰汽车',
        tel: '4008181188'
      },
      {
        name: '上海大众咨询',
        tel: '8008201111'
      },
      {
        name: '沃尔沃轿车',
        tel: '8009881200'
      },
      {
        name: '北京吉普',
        tel: '8008108880'
      },
      {
        name: '上海华普汽车',
        tel: '8008205598'
      },
      {
        name: '昌河汽车',
        tel: '4008879988'
      },
      {
        name: '东风本田',
        tel: '8008809899'
      },
      {
        name: '比亚迪汽车',
        tel: '4008303666'
      },
      {
        name: '凯迪拉克咨询',
        tel: '8008201902'
      },
      {
        name: 'Ford福特',
        tel: '8008108168'
      },
      {
        name: '北京现代',
        tel: '8008101100'
      },
      {
        name: '江铃汽车',
        tel: '8008691099'
      },
      {
        name: '东风雪铁龙',
        tel: '4008866688'
      },
      {
        name: '广州本田',
        tel: '8008308999'
      },
      {
        name: '一汽丰田',
        tel: '8008101210'
      },
      {
        name: '雪佛兰',
        tel: '8008201912'
      },
      {
        name: '北汽福田',
        tel: '4008199199'
      },
      {
        name: '南京依维柯',
        tel: '8008281892'
      }
    ]
  },
  {
    cate: '通信服务',
    children: [
      {
        name: '中国电信综合服务',
        tel: '10000'
      },
      {
        name: '中国电信手机服务',
        tel: '10001'
      },
      {
        name: '中国联通客服热线',
        tel: '10010'
      },
      {
        name: '中国移动客服热线',
        tel: '10086'
      },
      {
        name: '中国电信IP电话卡',
        tel: '17900、17901'
      },
      {
        name: '中国联通IP号码',
        tel: '17910、17911'
      },
      {
        name: '中国移动IP号码',
        tel: '17950、17951'
      },
      {
        name: '中国铁通服务电话',
        tel: '10050'
      },
      {
        name: '电话号码查询',
        tel: '114'
      },
      {
        name: '查号台（电信）',
        tel: '118114'
      },
      {
        name: '查号台（联通）',
        tel: '116114'
      }
    ]
  },
  {
    cate: '铁路航空',
    children: [
      {
        name: '铁路',
        tel: '12306'
      },
      {
        name: '国航',
        tel: '95583'
      },
      {
        name: '海航',
        tel: '950718'
      },
      {
        name: '南航',
        tel: '4006695539'
      },
      {
        name: '东航',
        tel: '95530'
      },
      {
        name: '深航',
        tel: '95080'
      },
      {
        name: '厦航',
        tel: '95557'
      },
      {
        name: '山航',
        tel: '4006096777'
      },
      {
        name: '川航',
        tel: '4008300999'
      }
    ]
  },
  {
    cate: '银行机构',
    children: [
      {
        name: '中国银行',
        tel: '95566'
      },
      {
        name: '交通银行',
        tel: '95559'
      },
      {
        name: '中国银联',
        tel: '95516'
      },
      {
        name: '招商银行',
        tel: '95555'
      },
      {
        name: '农业银行',
        tel: '95599'
      },
      {
        name: '民生银行',
        tel: '95568'
      },
      {
        name: '上海浦东发展银行',
        tel: '95528'
      },
      {
        name: '汇丰银行',
        tel: '8008302880'
      },
      {
        name: '东亚银行',
        tel: '8008303811'
      },
      {
        name: '兴业银行',
        tel: '95561'
      },
      {
        name: '工商银行',
        tel: '95588'
      },
      {
        name: '光大银行',
        tel: '95595'
      },
      {
        name: '广东发展银行',
        tel: '95508'
      },
      {
        name: '华夏银行',
        tel: '95577'
      },
      {
        name: '花旗银行',
        tel: '8008301880'
      },
      {
        name: '上海银行',
        tel: '021-962888'
      },
      {
        name: '中信银行',
        tel: '95558'
      },
      {
        name: '建设银行',
        tel: '95533'
      },
      {
        name: '邮政储蓄',
        tel: '95580'
      },
      {
        name: '深圳发展银行',
        tel: '95501'
      },
      {
        name: '北京银行',
        tel: '010-96169'
      }
    ]
  },
  {
    cate: '常用企业',
    children: [
      {
        name: '联想',
        tel: '8008-108-888'
      },
      {
        name: '惠普',
        tel: '8008-202-255'
      },
      {
        name: '戴尔',
        tel: '8008-580-888'
      },
      {
        name: '索尼',
        tel: '4008-109-000'
      },
      {
        name: '飞利浦',
        tel: '8008-201-201'
      },
      {
        name: '松下',
        tel: '8008-100-781'
      },
      {
        name: '爱普生',
        tel: '8008-109-977'
      },
      {
        name: '东芝',
        tel: '8008-108-208'
      },
      {
        name: 'NEC',
        tel: '8008-207-007'
      },
      {
        name: 'TCL',
        tel: '4008-123-456'
      },
      {
        name: '方正',
        tel: '8008-101-992'
      },
      {
        name: '七喜',
        tel: '020-82253777'
      },
      {
        name: '长城',
        tel: '8008-100-285'
      },
      {
        name: '明基(BENQ)',
        tel: '020-38900009'
      },
      {
        name: '清华同方',
        tel: '010-62789888'
      },
      {
        name: '诺基亚',
        tel: '4008-800-123'
      },
      {
        name: '三星',
        tel: '4008-105-858'
      },
      {
        name: '摩托罗拉',
        tel: '8008-105-050'
      },
      {
        name: '索爱',
        tel: '4008-100-000'
      },
      {
        name: 'LG',
        tel: '4008-199-999'
      },
      {
        name: '多普达',
        tel: '4008-201-668'
      },
      {
        name: '华硕',
        tel: '4006-006-655'
      },
      {
        name: '大中电器',
        tel: '8008-109-110'
      },
      {
        name: '国美电器',
        tel: '8009-906-600'
      },
      {
        name: '海尔',
        tel: '4006-999-999'
      },
      {
        name: '长虹',
        tel: '4008-111-666'
      },
      {
        name: '老板',
        tel: '8008-571-616'
      },
      {
        name: '苏泊尔',
        tel: '8008-576-717'
      }
    ]
  },
  {
    cate: '国家监督机构',
    children: [
      {
        name: '消费者申诉举报',
        tel: '12315'
      },
      {
        name: '价格监督',
        tel: '12358'
      },
      {
        name: '质量监督',
        tel: '12365'
      },
      {
        name: '环保监督',
        tel: '12369'
      },
      {
        name: '税务',
        tel: '12366'
      },
      {
        name: '市长热线',
        tel: '12345'
      },
      {
        name: '公共卫生',
        tel: '12320'
      },
      {
        name: '电信投诉',
        tel: '12300'
      },
      {
        name: '妇女维权',
        tel: '12338'
      },
      {
        name: '法律援助',
        tel: '12351'
      },
      {
        name: '劳动保障',
        tel: '12333'
      },
      {
        name: '机构编制违规举报',
        tel: '12310'
      },
      {
        name: '文化市场综合执法',
        tel: '12318'
      }
    ]
  },
  {
    cate: '外卖订餐',
    children: [
      {
        name: '麦当劳',
        tel: '4008517517'
      },
      {
        name: '肯德基',
        tel: '4008823823'
      },
      {
        name: '必胜客',
        tel: '4008123123'
      },
      {
        name: '真功夫',
        tel: '4006927927'
      },
      {
        name: '丽华快餐',
        tel: '4008800400'
      }
    ]
  },
  {
    cate: '快递物流',
    children: [
      {
        name: '申通快递',
        tel: '4008-895-543'
      },
      {
        name: 'EMS特快专递',
        tel: '11185'
      },
      {
        name: '顺丰速运',
        tel: '4008-111-111'
      },
      {
        name: '圆通速递',
        tel: '021-69777888'
      },
      {
        name: '中通速递',
        tel: '021-39777777'
      },
      {
        name: '韵达快运',
        tel: '021-39207888'
      },
      {
        name: '天天快递',
        tel: '021-67662333'
      },
      {
        name: '汇通快运',
        tel: '021-62963636'
      },
      {
        name: '速尔快递',
        tel: '4008822168'
      },
      {
        name: '德邦物流',
        tel: '4008305555'
      },
      {
        name: '宅急送',
        tel: '4006789000'
      },
      {
        name: '中铁快运',
        tel: '95572'
      },
      {
        name: '鑫飞鸿快递',
        tel: '021-69781999'
      },
      {
        name: 'UPS',
        tel: '4008-208-388'
      },
      {
        name: 'FedEx(联邦快递)',
        tel: '4008-861-888'
      },
      {
        name: 'DHL',
        tel: '4008-108-000'
      },
      {
        name: '新邦物流',
        tel: '4008-000-222'
      },
      {
        name: 'TNT',
        tel: '4008-209-868'
      },
      {
        name: '民航快递',
        tel: '4008-174-008'
      }
    ]
  },
  {
    cate: '常用大学',
    children: [
      {
        name: '北京大学',
        tel: '010-62752114'
      },
      {
        name: '南京大学',
        tel: '025-83593186'
      },
      {
        name: '华中科技大学',
        tel: '027-87541114'
      },
      {
        name: '北京师范大学',
        tel: '010-58800260'
      },
      {
        name: '中国农业大学',
        tel: '010-62896811'
      },
      {
        name: '天津大学',
        tel: '022-27403536'
      },
      {
        name: '兰州大学',
        tel: '0931-8911114'
      },
      {
        name: '哈尔滨工业大学',
        tel: '0451-86414060'
      },
      {
        name: '北京航空航天大学',
        tel: '010-82317114'
      },
      {
        name: '清华大学',
        tel: '010-62782165'
      },
      {
        name: '上海交通大学',
        tel: '021-34206500'
      },
      {
        name: '中山大学',
        tel: '020-84113480'
      },
      {
        name: '南开大学',
        tel: '022-23508219'
      },
      {
        name: '中国科技大学',
        tel: '0551-3601000'
      },
      {
        name: '华东师范大学',
        tel: '021-62233333'
      },
      {
        name: '东北大学',
        tel: '024-83679262'
      },
      {
        name: '浙江大学',
        tel: '0571-85172244'
      },
      {
        name: '武汉大学',
        tel: '027-68755114'
      },
      {
        name: '吉林大学',
        tel: '0431-85166420'
      },
      {
        name: '中南大学',
        tel: '0731-88876834'
      },
      {
        name: '西安交通大学',
        tel: '029-82668888'
      },
      {
        name: '同济大学',
        tel: '021-65982200'
      },
      {
        name: '香港大学',
        tel: '00852-28592111'
      },
      {
        name: '复旦大学',
        tel: '021-65642222'
      },
      {
        name: '中国人民大学',
        tel: '010-62511601'
      },
      {
        name: '四川大学',
        tel: '028-85406437'
      },
      {
        name: '山东大学',
        tel: '0531-88564774'
      },
      {
        name: '厦门大学',
        tel: '0592-2186110'
      },
      {
        name: '华南理工大学',
        tel: '020-87110000'
      },
      {
        name: '暨南大学',
        tel: '020-85220114'
      }
    ]
  }
])
</script>
